src/main/resources/wsdl/DLB/TicketEndpointService.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="TicketEndpointService" targetNamespace="http://impl.webservice.dl.app.bsbr.altec.com/" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:tns="http://impl.webservice.dl.app.bsbr.altec.com/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://impl.webservice.dl.app.bsbr.altec.com/" schemaLocation="TicketEndpointService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="validate">
    <part name="parameters" element="tns:validate">
    </part>
  </message>
  <message name="createResponse">
    <part name="parameters" element="tns:createResponse">
    </part>
  </message>
  <message name="create">
    <part name="parameters" element="tns:create">
    </part>
  </message>
  <message name="validateResponse">
    <part name="parameters" element="tns:validateResponse">
    </part>
  </message>
  <portType name="TicketEndpoint">
    <operation name="create">
      <input message="tns:create" wsam:Action="http://impl.webservice.dl.app.bsbr.altec.com/TicketEndpoint/createRequest">
    </input>
      <output message="tns:createResponse" wsam:Action="http://impl.webservice.dl.app.bsbr.altec.com/TicketEndpoint/createResponse">
    </output>
    </operation>
    <operation name="validate">
      <input message="tns:validate" wsam:Action="http://impl.webservice.dl.app.bsbr.altec.com/TicketEndpoint/validateRequest">
    </input>
      <output message="tns:validateResponse" wsam:Action="http://impl.webservice.dl.app.bsbr.altec.com/TicketEndpoint/validateResponse">
    </output>
    </operation>
  </portType>
  <binding name="TicketEndpointPortBinding" type="tns:TicketEndpoint">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="create">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
    <operation name="validate">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="TicketEndpointService">
    <port name="TicketEndpointPort" binding="tns:TicketEndpointPortBinding">
      <soap:address location="https://ymbdlb.santander.com.br:443/dl-ticket-services/TicketEndpointService"/>
    </port>
  </service>
</definitions>
