templates/solicitacao_ticket.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.webservice.dl.app.bsbr.altec.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<impl:create>
			<TicketRequest>
				<dados>
					<entry>
						<key>CONVENIO.COD-BANCO</key>
						<value>0033</value>
					</entry>
					<entry>
						<key>CONVENIO.COD-CONVENIO</key>
						<value>{cod_convenio}</value>
					</entry>
					<entry>
						<key>PAGADOR.TP-DOC</key>
						<value>{tp_doc}</value>
					</entry>
					<entry>
						<key>PAGADOR.NUM-DOC</key>
						<value>{num_doc}</value>
					</entry>
					<entry>
						<key>PAGADOR.NOME</key>
						<value>{pagador_nome}</value>
					</entry>
					<entry>
						<key>PAGADOR.ENDER</key>
						<value>{pagador_endereco}</value>
					</entry>
					<entry>
						<key>PAGADOR.BAIRRO</key>
						<value>{pagador_bairro}</value>
					</entry>
					<entry>
						<key>PAGADOR.CIDADE</key>
						<value>{pagador_cidade}</value>
					</entry>
					<entry>
						<key>PAGADOR.UF</key>
						<value>{pagador_uf}</value>
					</entry>
					<entry>
						<key>PAGADOR.CEP</key>
						<value>{pagador_cep}</value>
					</entry>
					<entry>
						<key>TITULO.NOSSO-NUMERO</key>
						<value>{nosso_numero}</value>
					</entry>
					<entry>
						<key>TITULO.SEU-NUMERO </key>
						<value>{seu_numero}</value>
					</entry>
					<entry>
						<key>TITULO.DT-VENCTO</key>
						<value>{data_vencimento}</value>
					</entry>
					<entry>
						<key>TITULO.DT-EMISSAO</key>
						<value>{data_emissao}</value>
					</entry>
					<entry>
						<key>TITULO.ESPECIE</key>
						<value>{especie}</value>
					</entry>
					<entry>
						<key>TITULO.VL-NOMINAL</key>
						<value>{valor_nominal}</value>
					</entry>
					<entry>
						<key>TITULO.PC-MULTA</key>
						<value>{multa}</value>
					</entry>
					<entry>
						<key>TITULO.QT-DIAS-MULTA</key>
						<value>{qt_dias_multa}</value>
					</entry>
					<entry>
						<key>TITULO.PC-JURO</key>
						<value>{juros}</value> </entry>
					<entry>
						<key>TITULO.TP-DESC</key>
						<value>{tipo_desconto}</value>
					</entry>
					<entry>
						<key>TITULO.VL-DESC</key>
						<value>{valor_desconto}</value>
					</entry>
					<entry>
						<key>TITULO.DT-LIMI-DESC</key>
						<value>{data_limite_desconto}</value>
					</entry>
					<entry>
						<key>TITULO.VL-ABATIMENTO</key>
						<value>{valor_abatimento}</value>
					</entry>
					<entry>
						<key>TITULO.TP-PROTESTO</key>
						<value>{tipo_protesto}</value>
					</entry>
					<entry>
						<key>TITULO.QT-DIAS-PROTESTO</key>
						<value>{qt_dias_protesto}</value>
					</entry>
					<entry>
						<key>TITULO.QT-DIAS-BAIXA</key>
						<value>{qt_dias_baixa}</value>
					</entry>
					<entry>
						<key>MENSAGEM</key>
						<value>{mensagem}</value>
					</entry>
				</dados>
				<expiracao>100</expiracao>
				<sistema>YMB</sistema>
			</TicketRequest>
		</impl:create>
	</soapenv:Body>
</soapenv:Envelope>
